<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class Cityseeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {


        $cities = [
            'تبریز', 'کندوان', 'بندر شرفخانه', 'مراغه', 'میانه', 'شبستر', 'مرند', 'جلفا', 'سراب', 'هایشهر',
            'بناب', 'كليبر', 'تسوج', 'اهر', 'هریس', 'عجب شیر', 'هشترود', 'ملکان', 'بستان آباد', 'ورزقان',
            'اسکو', 'آذر شهر', 'قره آغاج', 'ممقان', 'صوفیان', 'ایلخچی', 'خسروشهر', 'باسمنج', 'سهند',
            'ارومیه', 'نقد', 'ماکو', 'تکاب', 'خوی', 'مهاباد', 'سردشت', 'چالدران', 'بوکان', 'میاندوآب',
            'سلماس', 'شاهین دژ', 'پیرانشهر', 'سیه چشمه', 'اشنویه', 'چایپاره', 'پلدشت', 'شوط',
            'اردبیل', 'سرعین', 'بیله سوار', 'پارس آباد', 'خلخال', 'مشگین شهر', 'مغان', 'نمین', 'نیر', 'کوثر', 'کیوی', 'گرمی',
            'اصفهان', 'فریدن', 'فریدون شهر', 'قلاورجان', 'گلپایگان', 'دهقان', 'نطنز', 'نایین', 'تیران', 'کاشان',
            'فولاد شهر', 'اردستان', 'سمیرم', 'درچه', 'کوهپایه', 'مبارکه', 'شهررضا', 'خمینی شهر', 'شاهین شهر', 'نجف آباد',
            'دولت آباد', 'زرین شهر', 'آران و بیدگل', 'باغ بهاران', 'خوانسار', 'مهردشت', 'علویچه', 'عسگران', 'نهضت آباد', 'حاجی اباد',
            'تودشک', 'ورزنه',
            'ایلام', 'مهران', 'دهلران', 'آبدانان', 'شیروان چرداول', 'دره شهر', 'ایوان', 'سرابله',
            'بوشهر', 'تنگستان', 'دشتستان', 'دیر', 'دیلم', 'کنگان', 'گناوه', 'ریشهر', 'دشتی', 'خورموج',
            'اهرم', 'برازجان', 'خارک', 'جم', 'کاکی', 'عسلویه', 'بردخون',
            'تهران', 'ورامین', 'فیروزکوه', 'ری', 'دماوند', 'اسلام شهر', 'رودهن', 'لواسان', 'بومهن', 'تجریش',
            'فشم', 'کهریزک', 'پاکدشت', 'چهاردانگه', 'شریف آباد', 'قرچک', 'باقرشهر', 'شهریار', 'رباط کریم', 'قدس',
            'ملارد',
            'شهرکرد', 'فارسان', 'بروجن', 'چلگرد', 'اردل', 'لردگان', 'سامان',
            'قائن', 'فردوس', 'بیرجند', 'نهبندان', 'سربیشه', 'طبس مسینا', 'قهستان', 'درمیان',
            'مشهد', 'نیشابور', 'سبزوار', 'کاشمر', 'گناباد', 'طبس', 'تربت حیدریه', 'خواف', 'تربت جام', 'تایباد',
            'قوچان', 'سرخس', 'بردسکن', 'فریمان', 'چناران', 'درگز', 'کلات', 'طرقبه', 'سرولایت',
            'بجنورد', 'اسفراین', 'جاجرم', 'شیروان', 'آشخانه', 'گرمه', 'ساروج',
            'اهواز', 'ایرانشهر', 'شوش', 'آبادان', 'خرمشهر', 'مسجد سلیمان', 'ایذه', 'شوشتر', 'اندیمشک', 'سوسنگرد',
            'هویزه', 'دزفول', 'شادگان', 'بندرماهشهر', 'بندر امام خمینی', 'امیدیه', 'بهبهان', 'رامهرمز', 'باغ ملک', 'هندیجان',
            'لالی', 'رامشیر', 'حمیدیه', 'دغاغله', 'ملاثانی', 'ویسی',
            'زنجان', 'ابهر', 'خدابنده', 'طارم', 'ماهنشان', 'خرم دره', 'ایجرود', 'زیرین آباد', 'آب بر', 'قیدار',
            'سمنان', 'شاهرود', 'گرمسار', 'ایوانکی', 'دامغان', 'بسطام',
            'زاهدان', 'چابهار', 'خاش', 'سروان', 'زابل', 'سرباز', 'نیکشهر', 'راسک', 'میرجاوه',
            'شیراز', 'اقلید', 'داراب', 'فسا', 'مرودشت', 'خرم بید', 'آباده', 'کازرون', 'ممسنی', 'سپیدان',
            'لار', 'فیروز آباد', 'جهرم', 'نی ریز', 'استهبان', 'لامرد', 'مهر', 'حاجی آباد', 'نورآباد', 'اردکان',
            'صفاشهر', 'ارسنجان', 'قیروکارزین', 'سوریان', 'سروستان', 'ارژن', 'گویم', 'داریون', 'زرقان', 'خان زنیان',
            'کوار', 'ده بید', 'باب انار', 'بوانات', 'خرامه', 'خنج', 'ساخ دارگون',
            'قزوین', 'تاکستان', 'آبیک', 'بوئین زهرا',
            'قم',
            'طالقان', 'نظرآباد', 'اشتهارد', 'هشتگرد', 'کن', 'آسارا', 'شهرک گلستان', 'اندیشه', 'كرجکرج', 'گوهر دشت', 'ماهدشت', 'مشکین دشت',
            'سنندج', 'دیواندره', 'بانه', 'بیجارد', 'سقز', 'کامیاران', 'قروه', 'مریوان',
            'کرمان', 'راور', 'بابک', 'انار', 'کوهبنان', 'رفسنجان', 'بافت', 'سیرجان', 'کهنوج', 'زرند', 'بم', 'جیرفت', 'بردسیر',
            'کرمانشاه', 'اسلام آباد غرب', 'سرپل ذهاب', 'کنگاور', 'سنقر', 'قصر شیرین', 'گیلان غرب', 'هرسین', 'صحنه', 'پاوه', 'جوانرود', 'شاهو',
            'یاسوج', 'گچساران', 'دنا', 'دوگنبدان', 'سی سخت', 'دهدشت', 'لیک',
            'گرگان', 'آق قلا', 'گنبدکاوس', 'علی آباد کتول', 'مینودشت', 'ترکمن', 'کردکوی', 'بندرگز', 'کلاله', 'آزادشهر', 'رامیان',
            'رشت', 'منجیل', 'لنگرود', 'رودسر', 'تالش', 'آستارا', 'ماسوله', 'آستان اشرفیه', 'رودبار', 'فومن', 'صومعه سرا', 'بندرانزلی',
            'کلاچای', 'هشتیر', 'رضوان شهر', 'ماسال', 'شفت', 'سیاهکل', 'املش', 'لاهیجان', 'خشک بیجار', 'خمام', 'لشت نشا', 'بندرکیانشهر',
            'خرم آباد', 'ماهشهر', 'ذزفول', 'بروجرد', 'دورود', 'الیگودرز', 'ازنا', 'نورآباد', 'کوهدشت', 'الشتر', 'پلدختر',
            'ساری', 'آمل', 'بابل', 'بابلسر', 'بهشهر', 'تنکابن', 'جویبار', 'چالوس', 'رامسر', 'سوادکوه', 'قائم شهر', 'نکا', 'نور',
            'بلده', 'نوشهر', 'پل سفید', 'محمد آباد', 'فریدون کنار',
            'اراک', 'آشتیان', 'تفرش', 'خمین', 'دلیجان', 'ساوه', 'سربند', 'محلات', 'شازند',
            'بندرعباس', 'قشم', 'کیش', 'بندرلنگه', 'بستک', 'حاجی آباد', 'دهبارز', 'انگهران', 'میناب', 'ابوموسی',
            'بندر جاست', 'تنب بزرگ', 'بندر خمیر', 'پارسیان', 'همدان', 'ملایر', 'تویسرکان', 'نهاوند', 'کبودر آهنگ', 'رزن', 'اسدآباد', 'بهار',
            'یزد', 'تفت', 'اردکان', 'ابرکوه', 'میبد', 'طبس', 'بافق', 'مهریز', 'اشکذر', 'هرات', 'خضرآباد', 'شاهدیده', 'حمدیه شهر', 'سیدمیرزا', 'زارچ',
            'داعش'
        ];

        foreach ($cities as $iranCity)
        {
            City::create(['name'=>$iranCity]);
        }

    }
}
